Revit 2024 API
FailuresAccessor.IsFailureResolutionPermitted Method
Overload List
Name | Description
IsFailureResolutionPermitted()
 Checks if resolution of failures is permitted.
IsFailureResolutionPermitted(FailureMessageAccessor)
 Checks if default resolution of the failure is permitted.
IsFailureResolutionPermitted(FailureMessageAccessor, FailureResolutionType)
 Checks if resolution of the failure using given resolution type is permitted.
See Also
FailuresAccessor Class
FailuresAccessor Members
Autodesk.Revit.DB Namespace